app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY firstname
---
  def index
    me = current_user
    session[:me] = me.id
    @users = User.all