app/controllers/reviews_controller.rb

  def create
    @movie = Movie.find(params[:movie_id])
	@review = @movie.reviews.build(review_params)
	@review.user_id = current_user.id

	if @review.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "reviews" ("created_at", "movie_id", "rating_out_of_ten", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)