app/controllers/sessions_controller.rb

  def create
    user = User.where(:email => params[:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'roc@msn.com' LIMIT 1